In [27]:
import pandas as pd
import numpy as np
df = pd.read_csv(r'C:\Users\Anish Gupta\Desktop\weather_data.csv')
print (df)

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [4]:
df.shape

(9, 4)

In [3]:
df.ndim

2

In [4]:
df.head()

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow
3  1/6/2017          NaN        7.0    NaN
4  1/7/2017         32.0        NaN   Rain

In [5]:
df.tail()

         day  temperature  windspeed   event
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [6]:
df.head(3)

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow

In [7]:
df.dtypes

day             object
temperature    float64
windspeed      float64
event           object
dtype: object

In [8]:
df.describe()

       temperature  windspeed
count      5.00000   5.000000
mean      33.20000   8.400000
std        4.38178   2.302173
min       28.00000   6.000000
25%       32.00000   7.000000
50%       32.00000   8.000000
75%       34.00000   9.000000
max       40.00000  12.000000

In [5]:
df.to_numpy()

array([['1/1/2017', 32.0, 6.0, 'Rain'],
       ['1/4/2017', nan, 9.0, 'Sunny'],
       ['1/5/2017', 28.0, nan, 'Snow'],
       ['1/6/2017', nan, 7.0, nan],
       ['1/7/2017', 32.0, nan, 'Rain'],
       ['1/8/2017', nan, nan, 'Sunny'],
       ['1/9/2017', nan, nan, nan],
       ['1/10/2017', 34.0, 8.0, 'Cloudy'],
       ['1/11/2017', 40.0, 12.0, 'Sunny']], dtype=object)

In [8]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [7]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [9]:
df.T

,0,1,2,3,4,5,6,7,8
day,1/1/2017,1/4/2017,1/5/2017,1/6/2017,1/7/2017,1/8/2017,1/9/2017,1/10/2017,1/11/2017
temperature,32,NaN,28,NaN,32,NaN,NaN,34,40
windspeed,6,9,NaN,7,NaN,NaN,NaN,8,12
event,Rain,Sunny,Snow,NaN,Rain,Sunny,NaN,Cloudy,Sunny

In [10]:
df['temperature']

0    32.0
1     NaN
2    28.0
3     NaN
4    32.0
5     NaN
6     NaN
7    34.0
8    40.0
Name: temperature, dtype: float64

In [11]:
df[0:3]

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow

In [13]:
df.sort_index(axis=1, ascending=False)

   windspeed  temperature   event        day
0        6.0         32.0    Rain   1/1/2017
1        9.0          NaN   Sunny   1/4/2017
2        NaN         28.0    Snow   1/5/2017
3        7.0          NaN     NaN   1/6/2017
4        NaN         32.0    Rain   1/7/2017
5        NaN          NaN   Sunny   1/8/2017
6        NaN          NaN     NaN   1/9/2017
7        8.0         34.0  Cloudy  1/10/2017
8       12.0         40.0   Sunny  1/11/2017

In [14]:
df.sort_values(by='windspeed')

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
3   1/6/2017          NaN        7.0     NaN
7  1/10/2017         34.0        8.0  Cloudy
1   1/4/2017          NaN        9.0   Sunny
8  1/11/2017         40.0       12.0   Sunny
2   1/5/2017         28.0        NaN    Snow
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN

In [15]:
df.sort_values(by='temperature')

         day  temperature  windspeed   event
2   1/5/2017         28.0        NaN    Snow
0   1/1/2017         32.0        6.0    Rain
4   1/7/2017         32.0        NaN    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny
1   1/4/2017          NaN        9.0   Sunny
3   1/6/2017          NaN        7.0     NaN
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN

In [16]:
df.iloc[3]

day            1/6/2017
temperature         NaN
windspeed             7
event               NaN
Name: 3, dtype: object

In [17]:
df.iloc[2]

day            1/5/2017
temperature          28
windspeed           NaN
event              Snow
Name: 2, dtype: object

In [18]:
df.iloc[3:6,0:2]

        day  temperature
3  1/6/2017          NaN
4  1/7/2017         32.0
5  1/8/2017          NaN

In [19]:
df.iloc[[1, 2, 4], [0, 2]]

        day  windspeed
1  1/4/2017        9.0
2  1/5/2017        NaN
4  1/7/2017        NaN

In [20]:
df.iloc[1:3, :]

        day  temperature  windspeed  event
1  1/4/2017          NaN        9.0  Sunny
2  1/5/2017         28.0        NaN   Snow

In [21]:
df.iloc[:, 1:2]

   temperature
0         32.0
1          NaN
2         28.0
3          NaN
4         32.0
5          NaN
6          NaN
7         34.0
8         40.0

In [22]:
df[df.temperature > 0]

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
2   1/5/2017         28.0        NaN    Snow
4   1/7/2017         32.0        NaN    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [24]:
 df.mean()

temperature    33.2
windspeed       8.4
dtype: float64

In [25]:
 df.mean(1)

0    19.0
1     9.0
2    28.0
3     7.0
4    32.0
5     NaN
6     NaN
7    21.0
8    26.0
dtype: float64

In [28]:
 s = pd.Series(np.random.randint(0, 7, size=10))

In [29]:
s

0    0
1    4
2    0
3    0
4    4
5    2
6    5
7    1
8    2
9    0
dtype: int32

In [30]:
 s.value_counts()

0    4
4    2
2    2
5    1
1    1
dtype: int64

In [31]:
 df = pd.DataFrame(np.random.randn(10, 4))

In [32]:
df

          0         1         2         3
0  0.236720  0.165095 -0.574901 -1.001087
1 -0.905887 -0.062378  2.103632  1.451069
2 -0.273957 -0.177084  0.839739 -1.904173
3  1.241493 -0.691987 -0.061774 -0.416597
4  0.435236  1.601439 -0.525422 -0.352185
5  1.036599 -0.305488 -0.448870 -0.199525
6 -1.661416  1.683734  0.670719  1.381779
7 -0.804421  0.533240  0.144630 -0.658277
8 -0.377245  1.677624  0.529574  2.003223
9 -1.368671 -0.549586  0.046355 -0.716646

In [33]:
pieces = [df[:3], df[3:7], df[7:]]

In [34]:
pd.concat(pieces)

          0         1         2         3
0  0.236720  0.165095 -0.574901 -1.001087
1 -0.905887 -0.062378  2.103632  1.451069
2 -0.273957 -0.177084  0.839739 -1.904173
3  1.241493 -0.691987 -0.061774 -0.416597
4  0.435236  1.601439 -0.525422 -0.352185
5  1.036599 -0.305488 -0.448870 -0.199525
6 -1.661416  1.683734  0.670719  1.381779
7 -0.804421  0.533240  0.144630 -0.658277
8 -0.377245  1.677624  0.529574  2.003223
9 -1.368671 -0.549586  0.046355 -0.716646